# GetAreaReinforcementsInHost Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarHostData..::..GetAreaReinforcementsInHost Method
RebarHostData Class See Also
---
Returns all AreaReinforcement elements hosted by the referenced element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<AreaReinforcement> GetAreaReinforcementsInHost()
```

Visual Basic
---
```text
Public Function GetAreaReinforcementsInHost As IList(Of AreaReinforcement)
```

Visual C++
---
```text
public:
IList<AreaReinforcement^>^ GetAreaReinforcementsInHost()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace